{
    "lr": "A linear approach to modeling the relationshipbetween a scalar response (dependent variable) and one or more explanatory variables (independent variables). The case of one explanatory variable is called simple linear regression. A linearregression line has an equation of the form Y = a + bX, where X is the explanatory variable and Y is the dependent variable. The slope of theline is b, and a is the intercept (the value of y when x = 0).",
    "svm": "A Support Vector Machine model is a representation of the examples as points in space, mapped so that the examples of the separate categories are divided by a clear gap that is as wide as possible. New examples are then mapped into that same space and predicted to belong to a category based on the side of the gap on which they fall.",
    "pca": "Principal Component Analysis is a feature extraction methodthat uses orthogonal linear projections to capture the underlying variance of the data. It is a method used to reduce the number ofvariables in the data by extracting an important one from a large pool.It maps each instance of the given dataset present in a ‘d’ dimensionalspace to a ‘k’ dimensional subspace such that k < d.",
    "kmeans": "A method of vector quantization, originally from signal processing, that aims to partition n observations into k clusters in which each observation belongs to the cluster with the nearest mean,serving as a prototype of the cluster.",
    "hc": "A method of cluster analysis which seeks to build a hierarchy of clusters. The endpoint is a set of clusters, where each cluster is distinct from each other cluster, and the objects within each cluster are broadly similar to each other.",
    "fcmeans": "Fuzzy clustering is a form of clustering in which each data point can belong to more than one cluster.Clustering or cluster analysis involves assigning data points to clusters such that items in the same cluster are as similar as possible, while items belonging to different clusters are as dissimilar as possible. Clusters are identified via similarity measures.",
    "dt": "The goal of using a Decision Tree is to create atraining model that can be used to predict the class or value of thetarget variable by learning simple decision rules inferred from priordata (trained data). For predicting a class label for a record we startfrom the root of the tree, compare the values of the root attribute withthe record’s attribute. On the basis of comparison, we follow thebranch corresponding to that value and jump to the next node.",
    "knn": "K Nearest Neighbors is a simple algorithm that stores all available cases and classifies new cases based on a similarity measure (distance functions). A case is classified by a majority vote of its neighbors, with the case being assigned to the class most common amongst its K nearest neighbors measured by a distance function."
}